#include "fun_union_errors.h"

char* userEmailCheckMsg[] = {"缺少待验证的邮件地址!",
							 "该邮件地址已被注册!",
							 "恭喜，该邮件地址可以注册!"
							};

char* userRegMsg[]  = {"缺少邮件地址",
					   "请设置密码",
					   "请填写确认密码",
					   "两次输入的密码不一致",
					   "请填写呢称",
					   "请选择密码保护问题",
					   "请填写密码答案",
					   "注册失败，请重试",
					   "注册成功，请登录.."
						};

char* userLoginMsg[] = {"请填写邮件地址",
						"请填写密码",
						"错误的邮件地址或密码",
						"登录成功，请稍等..."
						};

char* userErrMsg[]	= {"未知错误"};

char* userHeaderMsg[] = {"错误提示",
						 "操作成功",
						 "申请通行证",
						 "会员登入",
						 "我的帐户",
						 "个人资料"
						 };
